//------------------------------------------------------------------------------
//	タイトル：		Input関連の関数
//	ファイル名：	Input.cpp
//	作成者：		AT13B284 28 CHIN HIU
//	作成日：		2016/05/10
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//	更新履歴:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//	インクルードファイル
//------------------------------------------------------------------------------
#include "main.h"
#include "input.h"
#include "keyboard.h"
#include "mouse.h"

//------------------------------------------------------------------------------
//	プロトタイプ宣言
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//	プロトタイプ宣言
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//	グローバル変数
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//	関数名:	CInput::CInput
//	引数:	なし
//	戻り値:	なし
//	説明:	コンストラクタ
//------------------------------------------------------------------------------
CInput::CInput()
{
	m_Input		= NULL;
	m_Keyboard	= NULL;
	m_Mouse		= NULL;
}

//------------------------------------------------------------------------------
//	関数名:	CInput::~CInput
//	引数:	なし
//	戻り値:	なし
//	説明:	コンストラクタ
//------------------------------------------------------------------------------
CInput::~CInput()
{
}

//------------------------------------------------------------------------------
//	関数名:	HRESULT CInput::Init
//	引数:	HINSTANCE hInstance, HWND hWnd
//	戻り値:	E_FAILだと初期化失敗、S_OKだと初期化成功
//	説明:	初期化処理
//------------------------------------------------------------------------------
HRESULT CInput::Init(HINSTANCE hInstance, HWND hWnd)
{
	m_Keyboard	= new CKeyboard;
	m_Mouse		= new CMouse;

	if (m_Input == NULL)
	{
		//  DirectInputオブジェクトの作成
		if (FAILED(DirectInput8Create
			(
				hInstance,
				DIRECTINPUT_VERSION,
				IID_IDirectInput8,
				(void**)&m_Input,
				NULL
			)))
		{
			MessageBox(hWnd, "DirectInput8オブジェクトの作成できませんでした。", "警告！", MB_ICONWARNING);
			return E_FAIL;
		}
	}

	//  キーボードの初期化
	m_Keyboard->Init(hInstance, hWnd, m_Input);

	//  マウスの初期化
	m_Mouse->Init(hInstance, hWnd, m_Input);

	return S_OK;
}

//------------------------------------------------------------------------------
//	関数名:	void CInput::Uninit
//	引数:	なし
//	戻り値:	なし
//	説明:	終了処理
//------------------------------------------------------------------------------
void CInput::Uninit(void)
{
	//  インターフェースを開放
	SAFE_RELEASE(m_Input);

	m_Keyboard->Uninit();

	m_Mouse->Uninit();

	delete m_Keyboard;

	delete m_Mouse;
}

//------------------------------------------------------------------------------
//	関数名:	void CInput::Update
//	引数:	なし
//	戻り値:	なし
//	説明:	更新処理
//------------------------------------------------------------------------------
void CInput::Update(void)
{
	m_Keyboard->Update();

	m_Mouse->Update();
}

//------------------------------------------------------------------------------
//	関数名:	CKeyboard *CInput::GetKeyboard
//	引数:	なし
//	戻り値:	m_Keyboard
//	説明:	キーボードを取得
//------------------------------------------------------------------------------
CKeyboard *CInput::GetKeyboard(void)
{
	return m_Keyboard;
}

//------------------------------------------------------------------------------
//	関数名:	CMouse *CInput::GetMouse
//	引数:	なし
//	戻り値:	m_Mouse
//	説明:	マウスを取得
//------------------------------------------------------------------------------
CMouse *CInput::GetMouse(void)
{
	return m_Mouse;
}