//------------------------------------------------------------------------------
//	タイトル：		デバッグプロシージャ処理のヘッダー
//	ファイル名：	debugProc.h
//	作成者：		AT12A244 33 CHIN HIU
//	作成日：		2015/12/03
//------------------------------------------------------------------------------
#ifndef _DEBUGPROC_H_
#define _DEBUGPROC_H_

//------------------------------------------------------------------------------
//	Const定義
//------------------------------------------------------------------------------
const int nFontMax = 1024;		//  デバッグ文字列の最大数

//------------------------------------------------------------------------------
//	マクロ定義
//------------------------------------------------------------------------------

//  デバッグプロシージャクラス
class CDebugProc
{
public:
	CDebugProc();
	~CDebugProc();
	void	Init(void);
	void	Uninit(void);
	void	Update(void);
	void	Draw(void);
	void	PrintDebugProc(char *fmt, ...);

private:
	LPD3DXFONT	m_pFont;						//  フォントへのポインタ
	char		m_StrDebug[nFontMax];
};

#endif