//------------------------------------------------------------------------------
//	タイトル：		ゲーム処理のヘッダー
//	ファイル名：	game.h
//	作成者：		AT12A244 33 CHIN HIU
//	作成日：		2016/07/11
//------------------------------------------------------------------------------
#ifndef _GAME_H_
#define _GAME_H_

//------------------------------------------------------------------------------
//	インクルードファイル
//------------------------------------------------------------------------------
#include "mode.h"

//------------------------------------------------------------------------------
//	前方宣言
//------------------------------------------------------------------------------
class CCamera;
class CLight;
class CPlayer;
class CEnemy_Hamina;
class CNumUI;
class CUI;

//------------------------------------------------------------------------------
//	Const定義
//------------------------------------------------------------------------------

const int nGameTime = 120;

//------------------------------------------------------------------------------
//	マクロ定義
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//	クラス宣言
//------------------------------------------------------------------------------

//  ゲームクラス
class CGame : public CMode
{
private:
	CCamera		*m_Camera;		//  カメラ
	CLight		*m_Light;		//  ライト
	CPlayer		*m_Player;		//  プレイヤー
	CEnemy_Hamina *m_Hamina;
	CNumUI		*m_NumUI;
	int			m_BGMSource;
	int			m_WaveSource;
	int			m_Time;
	int			m_FrameCnt;
	bool		m_bFail;
	bool		m_bOneCreat;
	int			m_GameResultCnt;
	CUI			*m_UI;

public:
	CGame();
	~CGame();
	void	Init(void);
	void	Uninit(void);
	void	Update(void);
	void	Draw(void);

	int		*GetTime(void) { return &m_Time; };
};

#endif