//------------------------------------------------------------------------------
//	タイトル：		タイトル処理のヘッダー
//	ファイル名：	title.h
//	作成者：		AT12A244 33 CHIN HIU
//	作成日：		2016/07/11
//------------------------------------------------------------------------------
#ifndef _TITLE_H_
#define _TITLE_H_

//------------------------------------------------------------------------------
//	インクルードファイル
//------------------------------------------------------------------------------
#include "mode.h"

//------------------------------------------------------------------------------
//	前方宣言
//------------------------------------------------------------------------------
class CCamera;
class CCamera_Data;
class CLight;
class CMeshField;
class CUI;
class CWater;

//------------------------------------------------------------------------------
//	Const定義
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//	マクロ定義
//------------------------------------------------------------------------------
#define TITLE_UI_OBJECT_MAX (3)

//------------------------------------------------------------------------------
//	enum定義
//------------------------------------------------------------------------------

//  タイトルキー列挙型
typedef enum
{
	//PRESS_ANY_KEY = 0,
	START_KEY = 0,
	EXIT_KEY,
	TITLE_KEY_MAX
}TITLE_KEY;

//------------------------------------------------------------------------------
//	構造体定義
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//	クラス定義
//------------------------------------------------------------------------------

//  タイトルUIデータクラス
class CTitleUI_Data : public CTex2D_Data
{
public:
	bool bEnter;
	bool bSelect;
	int	Frame;

	CTitleUI_Data()
		: bEnter(false)
		, bSelect(false)
		, Frame(0)
	{}
};

//  タイトルクラス
class CTitle : public CMode
{
public:
	CTitle();
	~CTitle();

	void	Init(void);
	void	Uninit(void);
	void	Update(void);
	void	Draw(void);
	void	KeyUpdate(void);

private:
	CCamera			*m_Camera;					//  カメラ
	CLight			*m_Light;					//  ライト
	CUI				*m_UI;						//  UI
	CMeshField		*m_Sea;						//  海
	CWater			*m_Water;					//  水

	int				m_SelectID[TITLE_KEY_MAX];	//  KEYマークID
	int				m_KeyID;					//  KEY選択用係数
};

#endif